[
    {
        "bookId": "1",
        "bookName": "Gone Girl",
        "author": "Gillian Flynn",
        "bookImg": "https://example.com/gone-girl.jpg",
        "review": "Gone Girl is a masterful psychological thriller that delves into the complexities of marriage, deceit, and the darkness lurking beneath the surface of a seemingly perfect relationship. The narrative is split between the perspectives of Nick and Amy, a couple whose lives spiral out of control when Amy mysteriously disappears. As the plot unfolds, the reader is taken on a rollercoaster of twists and turns, where every new revelation is more shocking than the last. Flynn's writing is sharp, and her characters are deeply flawed, making this a gripping and unforgettable read.",
        "totalPages": 422,
        "rating": 4.5,
        "category": "Thriller",
        "tags": [
            "Suspense",
            "Psychological"
        ],
        "publisher": "Crown Publishing Group",
        "yearOfPublishing": 2012
    },
    {
        "bookId": "2",
        "bookName": "The Silent Patient",
        "author": "Alex Michaelides",
        "bookImg": "https://example.com/the-silent-patient.jpg",
        "review": "The Silent Patient is a chilling psychological thriller that keeps readers on the edge of their seats from start to finish. The story revolves around Alicia Berenson, a successful artist who inexplicably shoots her husband and then refuses to speak another word. Her silence is as enigmatic as it is disturbing, leading to a media frenzy and widespread speculation. Enter Theo Faber, a forensic psychologist determined to unravel the mystery behind Alicia's silence. As he delves deeper into her past, the novel unravels a complex web of obsession, betrayal, and shocking truths that challenge everything Theo thought he knew. The Silent Patient is a brilliantly crafted novel that will leave readers questioning the nature of truth and the fragility of the human mind.",
        "totalPages": 336,
        "rating": 4.3,
        "category": "Psychological Thriller",
        "tags": [
            "Suspense",
            "Psychological"
        ],
        "publisher": "Celadon Books",
        "yearOfPublishing": 2019
    },
    {
        "bookId": "3",
        "bookName": "Big Little Lies",
        "author": "Liane Moriarty",
        "bookImg": "https://example.com/big-little-lies.jpg",
        "review": "Big Little Lies is a captivating novel that explores the dark underbelly of suburban life, where secrets and lies are woven into the fabric of seemingly perfect lives. Set in a tranquil seaside town, the story follows the lives of three women—Madeline, Celeste, and Jane—whose children attend the same kindergarten. As their paths intertwine, the novel reveals the pressures and expectations placed on women in modern society, as well as the devastating consequences of domestic violence. Moriarty's sharp wit and keen observations of human behavior make Big Little Lies a compelling and thought-provoking read that delves into the complexities of friendship, motherhood, and the lengths people will go to protect their secrets.",
        "totalPages": 460,
        "rating": 4.6,
        "category": "Contemporary Fiction",
        "tags": [
            "Drama",
            "Suspense"
        ],
        "publisher": "Penguin Publishing Group",
        "yearOfPublishing": 2014
    },
    {
        "bookId": "4",
        "bookName": "The Girl on the Train",
        "author": "Paula Hawkins",
        "bookImg": "https://example.com/the-girl-on-the-train.jpg",
        "review": "The Girl on the Train is a gripping psychological thriller that takes readers on a journey through the fractured mind of its protagonist, Rachel Watson. Every day, Rachel takes the same train, observing the lives of others as she passes by. One day, she witnesses something shocking, and her life becomes intertwined with the people she has been watching from afar. Hawkins expertly crafts a story of addiction, obsession, and the unreliability of memory, creating a narrative that is as unsettling as it is compelling. The novel's structure, with its shifting perspectives and unreliable narrators, keeps readers guessing until the very end, making The Girl on the Train a must-read for fans of psychological suspense.",
        "totalPages": 395,
        "rating": 4.1,
        "category": "Thriller",
        "tags": [
            "Suspense",
            "Psychological"
        ],
        "publisher": "Riverhead Books",
        "yearOfPublishing": 2015
    },
    {
        "bookId": "5",
        "bookName": "Sharp Objects",
        "author": "Gillian Flynn",
        "bookImg": "https://example.com/sharp-objects.jpg",
        "review": "Sharp Objects is a haunting psychological thriller that delves into the dark recesses of the human psyche. The story follows Camille Preaker, a journalist who returns to her hometown to cover the murder of two young girls. As she investigates, Camille is forced to confront her own troubled past, including a dysfunctional family and her struggle with self-harm. Flynn's prose is razor-sharp, and her portrayal of small-town life is both unsettling and atmospheric. The novel's exploration of trauma, mental illness, and the complexities of family relationships makes it a deeply affecting and disturbing read. Sharp Objects is a chilling and thought-provoking novel that lingers long after the final page.",
        "totalPages": 254,
        "rating": 4.2,
        "category": "Thriller",
        "tags": [
            "Suspense",
            "Psychological"
        ],
        "publisher": "Shaye Areheart Books",
        "yearOfPublishing": 2006
    },
    {
        "bookId": "6",
        "bookName": "The Night Circus",
        "author": "Erin Morgenstern",
        "bookImg": "https://example.com/the-night-circus.jpg",
        "review": "The Night Circus is a mesmerizing and enchanting novel that transports readers into a world of magic, mystery, and romance. The story revolves around a mysterious circus that appears without warning and operates only at night. Within the circus, two young illusionists, Celia and Marco, are locked in a fierce competition, bound by a contract they did not choose. As they perfect their craft, the circus becomes a stage for their dueling talents, but as their rivalry intensifies, so does their attraction to one another. Morgenstern's writing is lush and atmospheric, bringing the circus to life with vivid descriptions and a sense of wonder that permeates every page. The Night Circus is a spellbinding tale of love, destiny, and the magic that exists just beyond the boundaries of reality.",
        "totalPages": 387,
        "rating": 4.4,
        "category": "Fantasy",
        "tags": [
            "Fantasy",
            "Magical Realism"
        ],
        "publisher": "Doubleday",
        "yearOfPublishing": 2011
    }
]